Repository: vibrunazo/gengarbobo
Catalog: src/locale/*/messages.xlf
Languages: pt

# summNone
source: Summary will show here
pt: O resumo será mostrado aqui

# summNotFound
source: Could not find a Pokémon named "{{ message }}"
pt: Não encontrei um pokémon chamado "{{ message }}"

# summ01
source: Your {{ dad.name }} with <span>{{ ivs }}</span> IV has <span>{{ dad.yourpk.cp }}</span> cp at level <span>{{ dad.yourpk.level }}</span> for {{ LEAGUES[dad.league] }} league.
pt: Seu {{ dad.name }} com <span>{{ ivs }}</span> IV tem <span>{{ dad.yourpk.cp }}</span> cp no level <span>{{ dad.yourpk.level }}</span> para liga {{ LEAGUES[dad.league] }}.

# summ02
source: It's the <span>{{ dad.yourrank }}</span>{{ nth(dad.yourrank) }} best of <span>{{ dad.pks.length }}</span> possible combinatinons.
pt: É o <span>{{ dad.yourrank }}</span>° melhor de <span>{{ dad.pks.length }}</span> combinações possíveis.

# summ03
source: The rank 1 {{ dad.name }} by stats product is {{ r1ivs }}.<br/> When dueling against a {{ r1ivs }} {{ dad.name }}, your {{ dad.name }} deals <span>{{ dealt }}</span> damage, and you take <span>{{ taken }}</span> damage.<br/> Your {{ dad.name }} will <ng-container></ng-container> a duel against a rank 1 {{ dad.name }}.<br/> With the winner ending with {{ Math.abs(duel) }} health left. If using only fast attacks.
pt: O {{dad.name}} rank 1 por produto de stats é {{r1ivs}}.<br/> Quando duelando um {{dad.name}} {{r1ivs}}, seu {{dad.name}} causa <span>{{ dealt }}</span> de dano, e toma <span>{{ taken }}</span> de dano.<br/> Seu {{dad.name}} irá <ng-container></ng-container> um duelo contra o {{ dad.name }} rank 1.<br/> Com o vencedor terminando com {{Math.abs(duel)}} de vida sobrando. Se usar apenas ataques rápidos.

source: WIN
pt: VENCER

source: LOSE
pt: PERDER

source: DRAW
pt: EMPATAR

# descIV
source: Choose a Pokémon, a league and input its IVs. The app will tell you how good those IVs are for PvP.
pt: Escolha um Pokémon, a liga e seus IVs. O app irá te dizer se esses IVs são bons para PvP.

source: 0 Wild Catch
pt: 0 Selvagem

source: 12 Lucky Trade
pt: 12 Troca Sortuda

source: 10 Hatch/Quest/Raid
pt: 10 Ovo/Missão/Raid

source: 5 Best Trade
pt: 5 Troca 4 corações

source: 4 Weather Boost
pt: 4 Buff de Clima

source: 3 Ultra Trade
pt: 3 Troca 3 corações

source: 2 Great Trade
pt: 2 Troca 2 corações

source: 1 Good Trade
pt: 1 Troca 1 coração
